In [9]:
import pandas as pd

df_computer = pd.read_excel("ids.xlsx")
df_industry = pd.read_excel("endustri.xlsx")
df_results = pd.read_excel("results.xlsx")

In [10]:
df_industry

          ids
0    17069048
1    18069018
2    18061910
3    18061906
4    18061072
..        ...
152  19069607
153  20061080
154  19061501
155  20069009
156  21061072

[157 rows x 1 columns]

In [11]:
df_computer = df_computer["ids"]
df_computer = pd.DataFrame({"ids":df_computer})

In [12]:
df_computer

          ids
0    20011619
1    21011005
2    20011089
3    19011043
4    19011076
..        ...
101  20011001
102  20011007
103  19011922
104  20011093
105  20011038

[106 rows x 1 columns]

In [13]:
df_results.columns = "tc ids name surname grade".split()

In [14]:
df_results

             tc       ids     name  surname  grade
0     21*****90  18015903  AH*****  BE*****    100
1     10*****36  20056008  EC*****  BÜ*****    100
2     34*****26  1805C037  ZE*****  ÖZ*****    100
3     58*****56  21058051  AS*****  KÜ*****    100
4     47*****78  21024015  SE*****  ŞE*****    100
...         ...       ...      ...      ...    ...
2922  21*****44  18065178  ON*****  KE*****      2
2923  11*****06  19033008  MU*****  YI*****      0
2924  38*****90  20012083  ÖM*****  EM*****      0
2925  48*****38  19024041  EL*****  DA*****      0
2926  20*****84  19033041  SE*****  ŞA*****      0

[2927 rows x 5 columns]

In [26]:
context = {col:[] for col in df_results.columns}
df_concerned = pd.DataFrame(context)

In [15]:
df_results[df_computer["ids"][0] == df_results["ids"]]

             tc       ids     name  surname  grade
2348  24*****80  20011619  ON*****  DU*****     40

In [35]:
for student_id in df_computer["ids"]:
    match = df_results[student_id == df_results["ids"]]
    df_concerned = df_concerned.append(match, ignore_index=True)

/tmp/ipykernel_14505/3357827125.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_concerned = df_concerned.append(match, ignore_index=True)

In [40]:
final = df_concerned.sort_values(by=["grade"], ascending=False)

In [43]:
final.to_excel("siralama.xlsx")

# Second: Industry

In [27]:
context = {col:[] for col in df_results.columns}
df_concerned = pd.DataFrame(context)

In [28]:
df_results[df_industry["ids"][2] == df_results["ids"]]

Empty DataFrame
Columns: [tc, ids, name, surname, grade]
Index: []

In [29]:
for student_id in df_industry["ids"]:
    match = df_results[student_id == df_results["ids"]]
    df_concerned = df_concerned.append(match, ignore_index=True)

/tmp/ipykernel_19462/1996936907.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_concerned = df_concerned.append(match, ignore_index=True)

In [30]:
final = df_concerned.sort_values(by=["grade"], ascending=False)

In [31]:
final

            tc       ids     name  surname  grade
104  15*****30  20061022  AY*****  ES*****   98.0
60   45*****68  19061056  BE*****  GE*****   98.0
38   25*****68  19061061  İR*****  KU*****   98.0
117  44*****72  21061065  AY*****  GÜ*****   98.0
75   56*****98  20061072  ME*****  ŞA*****   96.0
..         ...       ...      ...      ...    ...
82   18*****34  20069010  EM*****  YI*****   36.0
28   29*****92  19069910  ME*****  Fİ*****   36.0
54   24*****30  20069926  ME*****  AL*****   34.0
57   51*****28  19069035  KE*****  UL*****   32.0
78   23*****96  20069914  SE*****  TO*****   28.0

[127 rows x 5 columns]

In [25]:
final.to_excel("industry_results.xlsx")